myinit.org
#+ STARTUP: overview

* Interface tweaks
#+BEGIN_SRC emacs-lisp
;; show column numbers
(setq column-number-mode t)
;; get rid of startup message
(setq inhibit-startup-message t)
(tool-bar-mode -1)
(toggle-scroll-bar -1)
(global-linum-mode t)
(fset 'yes-or-no-p 'y-or-n-p)
;; full screen by default
(set-frame-parameter nil 'fullscreen 'fullboth)
;; get rid of annoying sounds
(setq ring-bell-function 'ignore)
#+END_SRC

#+RESULTS:
: y-or-n-p

* Try
#+BEGIN_SRC emacs-lisp
(use-package try
  :ensure t)
#+END_SRC

* Which key
Brings up some help
#+BEGIN_SRC emacs-lisp
(use-package which-key
             :ensure t
             :config
             (which-key-mode))
#+END_SRC

* Org mode
#+BEGIN_SRC emacs-lisp
;; org-bullets
;; (use-package org-bullets
;;  :ensure t
;;  :config
;;  (add-hook 'org-mode-hook (lambda () (org-bullets-mode nil))))
(setq org-src-fontify-natively t)
(setq org-indent_mode nil)
;; markdown export
(require 'ox-md nil t)
#+END_SRC

#+RESULTS:
: t

* Swiper/ivy/counsel
#+BEGIN_SRC emacs-lisp
 (use-package counsel
  :ensure t
  :bind
  (("M-y" . counsel-yank-pop)
   :map ivy-minibuffer-map
   ("M-y" . ivy-next-line)))

 (use-package ivy
  :ensure t
  :diminish (ivy-mode)
  :bind (("C-x b" . ivy-switch-buffer))
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq ivy-display-style 'fancy))

 (use-package swiper
  :ensure t
  :bind (("C-s" . swiper)
	 ("C-r" . swiper)
	 ("C-c C-r" . ivy-resume)
	 ("M-x" . counsel-M-x)
	 ("C-x C-f" . counsel-find-file))
  :config
  (progn
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t)
    (setq ivy-display-style 'fancy)
    (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
    ))

  (use-package ivy-hydra
   :ensure t)
  #+END_SRC

* Avy
  Navigate by searching for a letter on the screen and jumping to it
  Currently commented out as I'm not sure I like it
  See https://github.com/abo-abo/avy for more info
  #+BEGIN_SRC emacs-lisp
  ;; (use-package avy
  ;; :ensure t
  ;; :bind ("M-s" . avy-goto-word-1)) ;; changed from char as per jcs
  #+END_SRC

* Autocomplete
  #+BEGIN_SRC emacs-lisp
 (use-package auto-complete
  :ensure t
  :init
  (progn
    (ac-config-default)
    (global-auto-complete-mode t)
    ))
  #+END_SRC
* Themes
#+BEGIN_SRC emacs-lisp
;; zenburn
 (use-package zenburn-theme
  :ensure t
  :config (load-theme 'zenburn t))

;; wheatgrass
;; (load-theme 'wheatgrass t)
#+END_SRC
* Reveal.js
#+BEGIN_SRC emacs-lisp
(use-package ox-reveal
:ensure ox-reveal)

(setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
(setq org-reveal-mathjax t)

(use-package htmlize
:ensure t)
#+END_SRC

* Evil mode
#+BEGIN_SRC emacs-lisp
(use-package evil
  :ensure t
  :config
  (evil-mode 1))
#+END_SRC

#+RESULTS:
: t

* Stan
** Stan mode
   #+BEGIN_SRC emacs-lisp
   (use-package stan-mode
     :ensure t)
   #+END_SRC
** Stan snippets
   #+BEGIN_SRC emacs-lisp
   (use-package stan-snippets
     :ensure t)
   #+END_SRC

* Latex 
** preview pane mode
   #+BEGIN_SRC emacs-lisp
   (use-package latex-preview-pane
     :ensure t)
   #+END_SRC
* Markdown
** markdown mode
   #+BEGIN_SRC emacs-lisp
   (use-package markdown-mode
    :ensure t
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
	    ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
    :init (setq markdown-command "multimarkdown"))
   #+END_SRC
** markdown command
   #+BEGIN_SRC emacs-lisp
   (custom-set-variables
    '(markdown-command "/usr/local/bin/pandoc"))
   #+END_SRC
   #+RESULTS:
* Projectile
#+BEGIN_SRC emacs-lisp
(use-package projectile
  :ensure t
  :config
  (projectile-global-mode)
(setq projectile-completion-system 'ivy))

(use-package counsel-projectile
  :ensure t
  :config
  (counsel-projectile-on))

#+END_SRC
* Dumb Jump
#+BEGIN_SRC emacs-lisp
(use-package dumb-jump
  :bind (("M-g o" . dumb-jump-go-other-window)
	 ("M-g j" . dumb-jump-go)
	 ("M-g x" . dumb-jump-go-prefer-external)
	 ("M-g z" . dumb-jump-go-prefer-external-other-window))
  :config (setq dumb-jump-selector 'ivy) ;; (setq dumb-jump-selector 'helm)

  :init
  (dumb-jump-mode)
    :ensure
)
#+END_SRC
* Magit
   #+BEGIN_SRC emacs-lisp
   (use-package magit
    :ensure t
    :bind (("C-x g" . magit-status)
           ("C-x M-g" . magit-dispatch-popup)))
   #+END_SRC
* Pdf-tools
#+BEGIN_SRC emacs-lisp
;;; Install epdfinfo via 'brew install pdf-tools' and then install the
;;; pdf-tools elisp via the use-package below. To upgrade the epdfinfo
;;; server, just do 'brew upgrade pdf-tools' prior to upgrading to newest
;;; pdf-tools package using Emacs package system. If things get messed
;;; up, just do 'brew uninstall pdf-tools', wipe out the elpa
;;; pdf-tools package and reinstall both as at the start.
(use-package pdf-tools
  :ensure t
  :config
  (custom-set-variables
    '(pdf-tools-handle-upgrades nil)) ; Use brew upgrade pdf-tools instead.
  (setq pdf-info-epdfinfo-program "/usr/local/bin/epdfinfo"))
(pdf-tools-install)

#+END_SRC
* ivy-bibtex
#+BEGIN_SRC emacs-lisp
(use-package ivy-bibtex
  :ensure t
  :bind (("M-i" . ivy-bibtex))
  :config
  (setq bibtex-completion-bibliography "/Users/teddy/Reading/bibliography.bib")
  (setq bibtex-completion-pdf-field "File")
  (setq bibtex-completion-library-path "/Users/teddy/Reading/pdf")
  (setq bibtex-completion-notes-path "/Users/teddy/Writing/notes/reading_notes.org"))

#+END_SRC
